In [1]:
import pandas as pd

DataFrame.drop(labels=None, *, 
               axis=0, 
               index=None,
               columns=None, 
               level=None, 
               inplace=False, 
               errors='raise')

Remove rows or columns by specifying label names and corresponding axis, or by directly specifying index or column names.

When using a multi-index, labels on different levels can be removed by specifying the level. S

In [3]:
data = {
    'name':['Dan','Deno','Evans','Joshua'],
    'marks':[78,90,67,87]
}

In [4]:
df = pd.DataFrame(data=data)

In [5]:
df

     name  marks
0     Dan     78
1    Deno     90
2   Evans     67
3  Joshua     87

## Removing Rows

#### Drop the second and third row in the dataframe above

In [18]:
df.drop(index=[1,2],
        axis=0,errors='raise')

     name  marks
0     Dan     78
3  Joshua     87

#### Dropping just one row, by default it will pick 0

In [10]:
df.drop(0)

     name  marks
1    Deno     90
2   Evans     67
3  Joshua     87

In [12]:
df.drop(index=0)

     name  marks
1    Deno     90
2   Evans     67
3  Joshua     87

In [15]:
df.drop(index=[1,2],errors='raise')

     name  marks
0     Dan     78
3  Joshua     87

## Removing columns

In [20]:
#add another column to the dataframe
reg = ['yes','no','yes','no']
df.insert(2,'attendance',reg)

In [21]:
df

     name  marks attendance
0     Dan     78        yes
1    Deno     90         no
2   Evans     67        yes
3  Joshua     87         no

In [29]:
df.drop(columns=['marks'],errors='raise')

     name attendance
0     Dan        yes
1    Deno         no
2   Evans        yes
3  Joshua         no

In [27]:
df.drop('marks',axis=1,errors='raise')

     name attendance
0     Dan        yes
1    Deno         no
2   Evans        yes
3  Joshua         no

In [26]:
df.drop(['marks'],axis=1,errors='raise')

     name attendance
0     Dan        yes
1    Deno         no
2   Evans        yes
3  Joshua         no

In [5]:
eval("6/4+2")

3.5